ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U0xx/stm32u083xx.h
/*******************  Bit definition for AES_KEYR1 register  ******************/
#define AES_KEYR1_Pos                       (0UL)
#define AES_KEYR1_Msk                       (0xFFFFFFFFUL << AES_KEYR1_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR1                           AES_KEYR1_Msk                           /*!< AES Key Register 1 */

/*******************  Bit definition for AES_KEYR2 register  ******************/
#define AES_KEYR2_Pos                       (0UL)
#define AES_KEYR2_Msk                       (0xFFFFFFFFUL << AES_KEYR2_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR2                           AES_KEYR2_Msk                           /*!< AES Key Register 2 */

/*******************  Bit definition for AES_KEYR3 register  ******************/
#define AES_KEYR3_Pos                       (0UL)
#define AES_KEYR3_Msk                       (0xFFFFFFFFUL << AES_KEYR3_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR3                           AES_KEYR3_Msk                           /*!< AES Key Register 3 */

/*******************  Bit definition for AES_KEYR4 register  ******************/
#define AES_KEYR4_Pos                       (0UL)
#define AES_KEYR4_Msk                       (0xFFFFFFFFUL << AES_KEYR4_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR4                           AES_KEYR4_Msk                           /*!< AES Key Register 4 */

/*******************  Bit definition for AES_KEYR5 register  ******************/
#define AES_KEYR5_Pos                       (0UL)
#define AES_KEYR5_Msk                       (0xFFFFFFFFUL << AES_KEYR5_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR5                           AES_KEYR5_Msk                           /*!< AES Key Register 5 */

/*******************  Bit definition for AES_KEYR6 register  ******************/
#define AES_KEYR6_Pos                       (0UL)
#define AES_KEYR6_Msk                       (0xFFFFFFFFUL << AES_KEYR6_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR6                           AES_KEYR6_Msk                           /*!< AES Key Register 6 */

/*******************  Bit definition for AES_KEYR7 register  ******************/
#define AES_KEYR7_Pos                       (0UL)
#define AES_KEYR7_Msk                       (0xFFFFFFFFUL << AES_KEYR7_Pos)         /*!< 0xFFFFFFFF */
#define AES_KEYR7                           AES_KEYR7_Msk                           /*!< AES Key Register 7 */

/*******************  Bit definition for AES_IVR0 register   ******************/
#define AES_IVR0_Pos                        (0UL)
#define AES_IVR0_Msk                        (0xFFFFFFFFUL << AES_IVR0_Pos)          /*!< 0xFFFFFFFF */
#define AES_IVR0                            AES_IVR0_Msk                            /*!< AES Initialization Vector Register 0 */

/*******************  Bit definition for AES_IVR1 register   ******************/
#define AES_IVR1_Pos                        (0UL)
#define AES_IVR1_Msk                        (0xFFFFFFFFUL << AES_IVR1_Pos)          /*!< 0xFFFFFFFF */
#define AES_IVR1                            AES_IVR1_Msk                            /*!< AES Initialization Vector Register 1 */

/*******************  Bit definition for AES_IVR2 register   ******************/
#define AES_IVR2_Pos                        (0UL)
#define AES_IVR2_Msk                        (0xFFFFFFFFUL << AES_IVR2_Pos)          /*!< 0xFFFFFFFF */
#define AES_IVR2                            AES_IVR2_Msk                            /*!< AES Initialization Vector Register 2 */

/*******************  Bit definition for AES_IVR3 register   ******************/
#define AES_IVR3_Pos                        (0UL)
#define AES_IVR3_Msk                        (0xFFFFFFFFUL << AES_IVR3_Pos)          /*!< 0xFFFFFFFF */
#define AES_IVR3                            AES_IVR3_Msk                            /*!< AES Initialization Vector Register 3 */

/*******************  Bit definition for AES_SUSPR0 register  ******************/
#define AES_SUSPR0_Pos                      (0UL)
#define AES_SUSPR0_Msk                      (0xFFFFFFFFUL << AES_SUSPR0_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR0                          AES_SUSPR0_Msk                          /*!< AES Suspend registers 0 */

/*******************  Bit definition for AES_SUSPR1 register  ******************/
#define AES_SUSPR1_Pos                      (0UL)
#define AES_SUSPR1_Msk                      (0xFFFFFFFFUL << AES_SUSPR1_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR1                          AES_SUSPR1_Msk                          /*!< AES Suspend registers 1 */

/*******************  Bit definition for AES_SUSPR2 register  ******************/
#define AES_SUSPR2_Pos                      (0UL)
#define AES_SUSPR2_Msk                      (0xFFFFFFFFUL << AES_SUSPR2_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR2                          AES_SUSPR2_Msk                          /*!< AES Suspend registers 2 */

/*******************  Bit definition for AES_SUSPR3 register  ******************/
#define AES_SUSPR3_Pos                      (0UL)
#define AES_SUSPR3_Msk                      (0xFFFFFFFFUL << AES_SUSPR3_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR3                          AES_SUSPR3_Msk                          /*!< AES Suspend registers 3 */

/*******************  Bit definition for AES_SUSPR4 register  ******************/
#define AES_SUSPR4_Pos                      (0UL)
#define AES_SUSPR4_Msk                      (0xFFFFFFFFUL << AES_SUSPR4_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR4                          AES_SUSPR4_Msk                          /*!< AES Suspend registers 4 */

/*******************  Bit definition for AES_SUSPR5 register  ******************/
#define AES_SUSPR5_Pos                      (0UL)
#define AES_SUSPR5_Msk                      (0xFFFFFFFFUL << AES_SUSPR5_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR5                          AES_SUSPR5_Msk                          /*!< AES Suspend registers 5 */

/*******************  Bit definition for AES_SUSPR6 register  ******************/
#define AES_SUSPR6_Pos                      (0UL)
#define AES_SUSPR6_Msk                      (0xFFFFFFFFUL << AES_SUSPR6_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR6                          AES_SUSPR6_Msk                          /*!< AES Suspend registers 6 */

/*******************  Bit definition for AES_SUSPR7 register  ******************/
#define AES_SUSPR7_Pos                      (0UL)
#define AES_SUSPR7_Msk                      (0xFFFFFFFFUL << AES_SUSPR7_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR7                          AES_SUSPR7_Msk                          /*!< AES Suspend registers 7 */

